# Personal machine packages

brew "go"
brew "just"
brew "mysql-client"
brew "ocrmypdf"
brew "pandoc"
brew "pnpm"
brew "racket"
brew "sqlite"
brew "tailscale"
brew "tesseract"
brew "uv"
brew "ykman"
brew "yt-dlp"

cask "1password"
cask "ableton-live-lite"
cask "adobe-creative-cloud"
cask "balenaetcher"
cask "brave-browser"
cask "chatgpt"
cask "chromium"
cask "claude"
cask "claude-code"
cask "discord"
cask "google-chrome"
cask "google-drive"
cask "ilok-license-manager"
cask "keybase"
cask "loom"
cask "microsoft-office"
cask "ngrok"
cask "slack"
cask "softube-central"
cask "thinkorswim"
cask "vlc"
cask "voiceink"
cask "wispr-flow"
cask "zoom"

mas "Goodnotes 6: AI Notes & Docs", id: 1444383602
