# Shared packages — installed on all machines
#
# Machine-specific packages are in Brewfile.personal or Brewfile.work

tap "buo/cask-upgrade"


brew "chezmoi"
brew "cmake"
brew "fzf"
brew "libuv"
brew "libgpg-error"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "httpie"
brew "jq"
brew "libyaml"
brew "llama.cpp"
brew "mas"
brew "node"
brew "nvm"
brew "onnx"
brew "pinentry-mac"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "re2"
brew "shellcheck"
brew "tmux"
brew "whisper-cpp"
brew "zlib"
brew "zsh"

cask "1password-cli"
cask "db-browser-for-sqlite"
cask "divvy"
cask "docker-desktop"
cask "ghostty"
cask "gpg-suite"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "numi"
cask "reader"
cask "stats"
cask "visual-studio-code"
cask "visual-studio-code@insiders"

mas "Trello", id: 1278508951
