# Personal machine packages

brew "abseil"
brew "c-ares"
brew "go"
brew "just"
brew "keyring"
brew "libuv"
brew "libgpg-error"
brew "mysql-client"
brew "ocrmypdf"
brew "onnx"
brew "pandoc"
brew "pinentry-mac"
brew "pnpm"
brew "pyenv"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "racket"
brew "re2"
brew "sqlite"
brew "tailscale"
brew "tesseract"
brew "ykman"
brew "yt-dlp"
brew "zlib"

cask "1password"
cask "ableton-live-lite"
cask "adobe-creative-cloud"
cask "balenaetcher"
cask "brave-browser"
cask "chatgpt"
cask "chromium"
cask "claude"
cask "claude-code"
cask "discord"
cask "dropbox"
cask "google-drive"
cask "gpg-suite"
cask "ilok-license-manager"
cask "keybase"
cask "microsoft-office"
cask "ngrok"
cask "slack"
cask "softube-central"
cask "thinkorswim"
cask "voiceink"
cask "zoom"

mas "Goodnotes 6: AI Notes & Docs", id: 1444383602
