# Shared packages — installed on all machines
#
# Machine-specific packages are in Brewfile.personal or Brewfile.work

tap "buo/cask-upgrade"

brew "chezmoi"
brew "cmake"
brew "fio"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "httpie"
brew "iperf3"
brew "jq"
brew "libyaml"
brew "mas"
brew "ripgrep"
brew "shellcheck"
brew "stress-ng"
brew "tmux"
brew "uv"
brew "zsh"

cask "1password-cli"
cask "divvy"
cask "ghostty"
cask "google-chrome"
cask "logi-options+"
cask "numi"
cask "reader"
cask "stats"
cask "visual-studio-code@insiders"

mas "Trello", id: 1278508951
