# Shared packages — installed on all machines
#
# Machine-specific packages are in Brewfile.personal or Brewfile.work

tap "buo/cask-upgrade"

brew "chezmoi"
brew "cmake"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "httpie"
brew "jq"
brew "mas"
brew "node"
brew "nvm"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "tmux"
brew "uv"
brew "yq"
brew "zsh"

cask "1password-cli"
cask "claude-code"
cask "codex"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "logi-options+"
cask "numi"
cask "reader"
cask "stats"
cask "visual-studio-code"
cask "voiceink"

mas "1Password for Safari", id: 1569813296
