# Personal machine packages

brew "abseil"
brew "gemini-cli"
brew "c-ares"
brew "keyring"
brew "libuv"
brew "libgpg-error"
brew "onnx"
brew "pandoc"
brew "racket"
brew "re2"
brew "sqlite"
brew "tailscale"
brew "tesseract"
brew "ykman"
brew "yt-dlp"
brew "zlib"

cask "1password"
cask "brave-browser"
cask "claude"
cask "claude-code"
cask "gcloud-cli"
cask "google-drive"
cask "voiceink"

mas "Goodnotes 6: AI Notes & Docs", id: 1444383602
